In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/LinkedInLearning/data_cleaning_python_2883183/main/Ch03/03_02/ships.csv')

In [3]:
df.head()

              name        lat        lng
0      Black Pearl  20.664865 -80.709747
1            Cobra  20.664868 -80.709740
2  Flying Dutchman  20.664878 -80.709941
3          Empress        NaN        NaN

In [4]:
# find atleast one column with atleast 1 missing value
df[df.isnull().any(axis=1)]

      name  lat  lng
3  Empress  NaN  NaN

In [5]:
#check the last row for missing data
# if this one is empty, it will display ' '
df.iloc[-1]['name']

'Empress'

In [6]:
df['name'] = df['name'].str.strip()

In [7]:
df.iloc[-1]['name']

'Empress'

In [8]:
df[df.isnull().any(axis=1)]

      name  lat  lng
3  Empress  NaN  NaN

isnull does not recognize the empty string

In [9]:
import numpy as np

In [13]:
# replace empty string with NaN

In [14]:
mask = df['name'].str.strip() == ''

In [15]:
df.loc[mask,'name'] = np.nan

all empty cells will be replaced with NaN

In [16]:
df[df.isnull().any(axis=1)]

      name  lat  lng
3  Empress  NaN  NaN

read more missing data in pandas documentation